# Вычислить площадь треугольника по формуле Герона.
# Пользователь вводит значение для 3 сторон.
# В результате выводится площадь треугольника
 # https://ru.wikipedia.org/wiki/%D0%A4%D0%BE%D1%80%D0%BC%D1%83%D0%BB%D0%B0_%D0%93%D0%B5%D1%80%D0%BE%D0%BD%D0%B0
 # треугольник с такими сторонами существует 
 # Условие существования треугольника: a + b > c или a + с > b или c + b > a
import math

a: int = int(input("Введите первую сторону: "))
b: int = int(input("Введите вторую сторону: "))
c: int = int(input("Введите третью сторону: "))

if (a + b > c) and (a + c > b) and (c + b > a):
    p = 1/2 * (a+b+c)
    area = math.sqrt(p*(p-a)*(p-b)*(p-c))
    
    print("Площадь треугольника равна " + str(area))
else:
    print("Такого треугольника не существует")


