# Программа запрашивает кол-во баллов
# Если  кол-во баллов больше 90 оценка 5
# Если количество баллов от 75 до 89 оценка 4
# от 60 до 75 оценка 3
# меньше 60 не сдал

score: int = int(input("Введите количество баллов за экзамен: "))
if score >= 90:
    print("Ваша оценка 5")
else:
    if score >= 75:
        print("Ваша оценка 4")
    else:
        if score >= 60:
           print("Ваша оценка 3")
        else:
            print("Вы не сдали экзамен") 

if score >= 90:
    print("Ваша оценка 5")
elif score >= 75:  
    print("Ваша оценка 4")
elif score >= 60: 
    print("Ваша оценка 3")
else:
    print("Вы не сдали экзамен")

# Запросить погоду: солнце, дождь, пасмурно и ветренно. 
# Если солнце, наденьте солнечные очки. Если дождь, возьмите зонт. 
# Если пасмурно, наденьте кофту. 
# Если ветренно, наденьте куртку.

