# Запросить погоду: солнце, дождь, пасмурно и ветренно. 
# Если солнце, наденьте солнечные очки. Если дождь, возьмите зонт. 
# Если пасмурно, наденьте кофту. 
# Если ветренно, наденьте куртку.

weather: str = input("Какая погода сегодня в вашем городе: ")
if weather == "дождливо":
    print("возьмите зонт")
else:
    if weather ==  "солнечно":
        print("наденьте солнечные очки")
    else:
        if weather == "пасмурно":
           print("Hаденьте кофту")
        else:
            if weather == "ветренно":
               print("Hаденьте куртку")

if weather == "дождливо":
    print("возьмите зонт")
elif weather == "солнечно":
    print("наденьте солнечные очки")
elif weather == "пасмурно":
    print("Hаденьте кофту")
elif weather == "ветренно":
    print("Hаденьте куртку")
else:
    print("Нет предложений по одежде")