# Пользователь вводит число.
# 1. Если число делится на 3, то напечатать fizz
# 2. Если число делится на 5, то напечатать buzz
# 3. Если число делится и на 3 и на 5, то напечатать fizzbuzz
# 4. В противном случае напечатать само число

a: int = int(input("Введите число: "))

result = ""

if a % 3 == 0:
    result = "fizz"
if a % 5 == 0:
    result = result + "buzz"
if result == "":
    result = str(a)

print(result)
